Tekla Open API Reference for Tekla Structures 2025
RebarItem Fields
The RebarItem type exposes the following members.
Fields
Name | Description
DIAGONAL_DISTANCE_STRING
 The diagonal distance string.
DIAGONAL_RATIO_STRING
 The diagonal ratio string.
HORIZONTAL_DISTANCE_STRING
 The horizontal distance string.
HORIZONTAL_RATIO_STRING
 The horizontal ratio string.
MAIN_USAGE
 The main usage string.
TIE_STIRRUP_USAGE
 The tie/stirrup usage string.
Top
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace